RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/InformationRegisters/CustomsFilesOfGoods/CustomsFilesOfGoods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CustomsFilesOfGoods</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
      <types>DocumentRef.ГТД</types>
    </type>
  </resources>
  <resources>
    <name>DTNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>28</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>DTLineNo</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/AccumulationRegisters/QtyOfItemsInTemporaryImpExp/QtyOfItemsInTemporaryImpExp.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>QtyOfItemsInTemporaryImpExp</name>
  <resources>
    <name>Qty</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Documents/BoxesOfCustomsFiles/BoxesOfCustomsFiles.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>BoxesOfCustomsFiles</name>
  <posting>Deny</posting>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>DispatchDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ListOfCustomsFiles</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>CustomsFiles</name>
    <attributes>
      <name>CustomsFile</name>
      <type>
        <types>DocumentRef.ГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>CustomsFilesLight</name>
    <attributes>
      <name>CustomsFileLight</name>
      <type>
        <types>DocumentRef.CustomsFilesLight</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/Documents/CustomsFilesLight/Forms/ФормаВыбора/Module.bsl
// ДОДЕЛАТЬ
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПОДУМАТЬ, МОЖЕТ БЫТЬ НАСТРАИВАТЬ ФОРМЫ ВЫБОРА ПРЯМО ИЗ ФОРМЫ, ОТКУДА ПРОИЗВОДИТСЯ ВЫБОР
	Если Параметры.Свойство("СтруктураНастройки") Тогда
		
		СтруктураНастройки = Параметры.СтруктураНастройки;
		Если СтруктураНастройки.Имя = "ВыборИзCustomsPaymentAllocation" Тогда
			НастроитьДляВыбораИзCustomsPaymentAllocation(СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзBoxOfCustomsFiles" Тогда
			НастроитьДляВыбораИзBoxOfCustomsFiles(СтруктураНастройки);
		ИначеЕсли СтруктураНастройки.Имя = "ВыборИзTemporaryImpExpTransactions" Тогда
			НастроитьДляВыбораИзTemporaryImpExpTransactions(СтруктураНастройки);
		КонецЕсли;
		     		
	КонецЕсли;
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	ImportExportСервер.ДобавитьОтборПоProcessLevelПриНеобходимости(Отбор, "ProcessLevel");
	
КонецПроцедуры
     
&НаСервере
Процедура НастроитьДляВыбораИзCustomsPaymentAllocation(СтруктураНастройки)

	СтруктураПодбора = CustomsСервер.ПолучитьСтруктуруПодбораТПОForAllocation(СтруктураНастройки.CustomsPayment);
			
	Отбор = Параметры.Отбор;
	
	Если ЗначениеЗаполнено(СтруктураПодбора.Customs) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			Список.Отбор,
			"CustomsPost.Customs",
			СтруктураПодбора.Customs,
			ВидСравненияКомпоновкиДанных.Равно);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПодбора.CCDReference) Тогда
		Отбор.Вставить("SeqNo", СтруктураПодбора.CCDReference);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураПодбора.SoldTo) Тогда
		Отбор.Вставить("SoldTo", СтруктураПодбора.SoldTo);
	КонецЕсли;
			
	Отбор.Вставить("Ссылка", СтруктураПодбора.ТПО);
	Если ЗначениеЗаполнено(СтруктураНастройки.CurrentCustomsDocument) Тогда
		Отбор.Ссылка.Добавить(СтруктураНастройки.CurrentCustomsDocument);
	КонецЕсли; 
	
	Отбор.Вставить("Проведен", Истина);
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзBoxOfCustomsFiles(СтруктураНастройки)
	
	Отбор = Параметры.Отбор;
	
	Отбор.Вставить("ProcessLevel", СтруктураНастройки.ProcessLevel);
	
	Отбор.Вставить("Проведен", Истина);
	
	Отбор.Вставить("ПометкаУдаления", Ложь);
	
	// Отфильтруем по ссылке только те Customs files light, которые еще не вошли в другие Boxes.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ProcessLevel", СтруктураНастройки.ProcessLevel);
	Запрос.УстановитьПараметр("CurrentBox", СтруктураНастройки.CurrentBox);
	Запрос.УстановитьПараметр("CurrentCustomsFilesLight", СтруктураНастройки.CurrentCustomsFilesLight);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	CustomsFilesLight.Ссылка
		|ИЗ
		|	Документ.CustomsFilesLight КАК CustomsFilesLight
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.BoxesOfCustomsFiles.CustomsFilesLight КАК BoxesOfCustomsFilesCustomsFilesLight
		|		ПО CustomsFilesLight.Ссылка = BoxesOfCustomsFilesCustomsFilesLight.CustomsFileLight
		|			И (НЕ BoxesOfCustomsFilesCustomsFilesLight.Ссылка.ПометкаУдаления)
		|			И (НЕ BoxesOfCustomsFilesCustomsFilesLight.Ссылка = &CurrentBox)
		|ГДЕ
		|	CustomsFilesLight.ProcessLevel = &ProcessLevel
		|	И НЕ CustomsFilesLight.ПометкаУдаления
		|	И CustomsFilesLight.Проведен
		|	И BoxesOfCustomsFilesCustomsFilesLight.Ссылка ЕСТЬ NULL 
		|	И НЕ CustomsFilesLight.Ссылка В (&CurrentCustomsFilesLight)";
	CustomsFiles = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Параметры.Отбор.Вставить("Ссылка", CustomsFiles);
	
	Параметры.МножественныйВыбор = Истина;
	
КонецПроцедуры

&НаСервере
Процедура НастроитьДляВыбораИзTemporaryImpExpTransactions(СтруктураНастройки)
	
	Отбор = Параметры.Отбор;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", СтруктураНастройки.Дата);
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CustomsFilesOfGoods.CustomsFile
	|ИЗ
	|	РегистрСведений.CustomsFilesOfGoods КАК CustomsFilesOfGoods
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.QtyOfItemsInTemporaryImpExp.Остатки(&Дата, ) КАК QtyOfItemsInTemporaryImpExpОстатки
	|		ПО (QtyOfItemsInTemporaryImpExpОстатки.Item = CustomsFilesOfGoods.Item)
	|ГДЕ
	|	CustomsFilesOfGoods.CustomsFile ССЫЛКА Документ.CustomsFilesLight";
	
	Отбор.Вставить("Ссылка", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("CustomsFile"));
	
	Если СтруктураНастройки.Свойство("ImportExport") Тогда
		Отбор.Вставить("ImportExport", СтруктураНастройки.ImportExport);
	КонецЕсли;
	
КонецПроцедуры
